#УСЛОВНЫЕ ОПЕРАТОРЫ
                            #  ctrl + /   =  комментир выделением
a = 5

if a == 5:
    c = "Равно 5"

elif a == 4:
    c = "Равно 4" 

elif a == 3:
    c = "Равно 3"

elif a == 2:
    c = "Равно 2"    

else:
    c = "Ничему не равно"

#-------------------------------------------------------------

b = -9


if b < 10 and b > 0:
    c = " 0 < b < 10"
elif b > 10:
    c = " b > 10"
else:
    c = "b < 0"    


x = True

# if not x:
#     print("Foo")
# else:
#     print("Bar")

#------------------------------------------------------------

#   ***** ПРОСТОЙ КАЛЬКУЛЯТОР *****

a = int(input("Введите первое число: "))
operation = input("Введите символ операции ( +, -, *, /, ^, //, %): ")
b = int(input("Введите второе число: "))

if operation == "+":
    res = a + b
elif operation == "-":
    res = a - b
elif operation == "*":
    res = a * b
elif operation == "/":
    res = a / b
elif operation == "^":
    res = a ** b
elif operation == "//":
    res = a // b    
else:
    res = "Символ операции некорректный"

print(f"Результат: {res}")

# ДОАМШКА !!!                ДОПИЛИТЬ КАЛЬКУЛЯТОР ПО БЕЗОПАСНОСТИ (НЕГАТИВ ТЕСТИНГ)  (ДОБАВИТЬ КЛАСС TYPE , ДОБАВИТЬ ДРУГИЕ УСЛОВНЫЕ ОПЕРАТОРЫ С ПРЕДЛОГОМ ВВЕСТИ ПО НОВОЙ)
